{
  "lastFetched": "2026-01-31T18:56:28.612Z",
  "placeRating": 4.9,
  "totalReviews": 81,
  "reviews": [
    {
      "text": "We’re small strata with a few units and we hadn’t done any exterior maintenance for over 10 years since moving in. Simsan and his team did an amazing job — they carefully removed all the moss and dirt, clean gutters by hand, washed the siding and treated the roof with care and expertise. The crew was professional, efficient and hardworking, completing everything in  two days and come back again to make sure everything is good.\n\nIt was very satisfying to watch them work and the results are incredible — our strata looks brand new again! Both Simon and Sandeep are great guys to deal with: friendly, professional and easy to communicate with. They also offered us a very reasonable price compared to other vendors.\n\nWe’re extremely happy we chose them. Thank you!",
      "author": "Kai Lee",
      "rating": 5,
      "link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sCi9DQUlRQUNvZENodHljRjlvT2tZellVNW1WVmRxTTNaTFZVaHhkWFk0TmpJdGJVRRAB!2m1!1s0x0:0x4cb8cdfc07e644a8!3m1!1s2@1:CAIQACodChtycF9oOkYzYU5mVVdqM3ZLVUhxdXY4NjItbUE%7C0d2L6rZiSzp%7C?hl=en-US",
      "date": "2 months ago",
      "thumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjU3VR_OrPNo6aF4ar7Kas5spNM9KXMIIAIadoYuG50cxNOXwww=s120-c-rp-mo-ba4-br100"
    },
    {
      "text": "We live in a detached house with a larger concrete tile roof. It was covered in moss and in desperate need of a cleaning. Raj and his team came in the morning and cleaned the whole roof, gave it a moss treatment, cleaned all the gutters, power washed our concrete landings and cleaned up the mess in one day. Overall very happy with the results. We'll be reaching out to Simsan again the next time we need similar work done.",
      "author": "Neema Teymory",
      "rating": 5,
      "link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sCi9DQUlRQUNvZENodHljRjlvT25KbFFuWnNORUZSUWxaWmVHSmxNVkJwYjFkRVRuYxAB!2m1!1s0x0:0x4cb8cdfc07e644a8!3m1!1s2@1:CAIQACodChtycF9oOnJlQnZsNEFRQlZZeGJlMVBpb1dETnc%7C0dPw8bWfQPB%7C?hl=en-US",
      "date": "2 weeks ago",
      "thumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjUBqwgC4Ug5SgQH5fPZQI--l5wsOrqrLnekiS2w3EWnFDJyXeQbFg=s120-c-rp-mo-br100"
    },
    {
      "text": "I had these folks clean the moss from my 50 year old Terra Cotta tile roof, clean the gutters and wash the exterior of my windows and doors. All jobs that were well overdue and that I knew were beyond my abilities. I was very happy with the results and would not hesitate to recommend them to my friends and neighbours .\n\nThey committed to taking before and after pics (a few which I've posted here), cleaning the individual tiles BY HAND (I'm not kidding...by hand!) and cleaning up after the job. All of this was done as promised and to my satisfaction. The amount of moss and debris they removed was impressive to say the least.\n\nNormally I don't do business with a door2door sales call and rely on recommendations, references, google reviews etc. This is due to a very bad experience I had in the past (looking at you Canadian Property Stars). I'm very glad I went with my gut instincts this time  that told me these guys were honest and would do a quality job.\n\nIf you're reading this and wondering if you should do business with Simsan Fraser Maintenance Ltd, do it. You won't regret your decision.",
      "author": "Steve Lloyd",
      "rating": 5,
      "link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNiMXViRFdBEAE!2m1!1s0x0:0x4cb8cdfc07e644a8!3m1!1s2@1:CIHM0ogKEICAgICb1ubDWA%7CCgwIlaCQtQYQgI_mgAI%7C?hl=en-US",
      "date": "a year ago",
      "thumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjX5mSZbHG3POhBmEwMM-hOBEYT_rfM4l_81Z3bGYN7YJSopu5E=s120-c-rp-mo-br100"
    },
    {
      "text": "I got a cold-call knock on my door offering to clean my roof.  They were more expensive than my prior contractor from 3 years ago, but the crew at Simsan did more meticulous and much better job of cleaning moss from my roof and worth it.   I took these photos before and the day after.  Would highly recommend.",
      "author": "Stephen Chan",
      "rating": 5,
      "link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURoZ2FTczd3RRAB!2m1!1s0x0:0x4cb8cdfc07e644a8!3m1!1s2@1:CIHM0ogKEICAgIDhgaSs7wE%7CCgsIhMGroAYQ2P2CLw%7C?hl=en-US",
      "date": "2 years ago",
      "thumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjUktdF7GT_w3iu8VbGnvN_pjTSi92Nl-kXhR2ai8IviDcWFWQ6jrQ=s120-c-rp-mo-ba3-br100"
    },
    {
      "text": "Thank you Simsan Maintenance for cleaning off the roof moss and cleaning the gutters at our house. Táíwò did an excellent job. Sandeep’s time and cost estimate for the moss removal etc was completely accurate. Thank you Simon for giving us a quote for future painting the house trim and for cleaning the house siding. We will book your company in Spring 2026 to do these jobs. The before and after photos provided of  22 years of accumulated moss were striking and will be used for future insurance renewal. Completely satisfied.\nMichael",
      "author": "mykeleena",
      "rating": 5,
      "link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sCi9DQUlRQUNvZENodHljRjlvT2tWQ2VsaE5WemxUYW1aR2R5MDRUSEJHZGpGNlVVRRAB!2m1!1s0x0:0x4cb8cdfc07e644a8!3m1!1s2@1:CAIQACodChtycF9oOkVCelhNVzlTamZGdy04THBGdjF6UUE%7C0coj6etW8OI%7C?hl=en-US",
      "date": "4 months ago",
      "thumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjUEc8SD16Nd5TOVXORgUd_mP8j51QrZWFgUlyYKiUlHGG5_mN9F=s120-c-rp-mo-br100"
    },
    {
      "text": "fantastic job! talked with the nice man karan and got a attractive price. then their worker came several day later and spent over hours to did deep clean for roof surface and tough moss. finally the roof turned brand new again and will last longer for sure!",
      "author": "he xu",
      "rating": 5,
      "link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUQ5cFpTaS13RRAB!2m1!1s0x0:0x4cb8cdfc07e644a8!3m1!1s2@1:CIHM0ogKEICAgID9pZSi-wE%7CCgsI96LkrwYQwL3lFg%7C?hl=en-US",
      "date": "a year ago",
      "thumbnail": "https://lh3.googleusercontent.com/a-/ALV-UjX7bLop9qIyh0n2fr3CtpK01WVg7A7_awMyhrf9Sevq6MyMI0gt=s120-c-rp-mo-ba3-br100"
    },
    {
      "text": "The Simsan team did a great job on our roof and gutters. Alex and his partner brushed and removed all the moss by hand, cleared the gutters and cleaned up thoroughly after. They were competent and professional. We are very satisfied and would recommend their services to others!",
      "author": "Sharon Wang",
      "rating": 5,
      "link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sCi9DQUlRQUNvZENodHljRjlvT2xSM2RDMXFVRkIxVjJKQmIwdGhNRjlSWWtKQk5FRRAB!2m1!1s0x0:0x4cb8cdfc07e644a8!3m1!1s2@1:CAIQACodChtycF9oOlR3dC1qUFB1V2JBb0thMF9RYkJBNEE%7C0cTNaQENUII%7C?hl=en-US",
      "date": "6 months ago",
      "thumbnail": "https://lh3.googleusercontent.com/a/ACg8ocJW5N3JIOtFi9Wq0O2GVUxcoHlMRYnEHc2K-Brkgvbgj6yucw=s120-c-rp-mo-ba3-br100"
    }
  ]
}